Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/eth.h
/* -------- ETH_PEFRSH : (ETH Offset: 0x10F4) ( R/ 32) PTP Peer Event Frame Received Seconds High Register -------- */
#define ETH_PEFRSH_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_PEFRSH) PTP Peer Event Frame Received Seconds High Register  Reset Value */

#define ETH_PEFRSH_RUD_Pos                    _UINT32_(0)                                          /* (ETH_PEFRSH) Register Update Position */
#define ETH_PEFRSH_RUD_Msk                    (_UINT32_(0xFFFF) << ETH_PEFRSH_RUD_Pos)             /* (ETH_PEFRSH) Register Update Mask */
#define ETH_PEFRSH_RUD(value)                 (ETH_PEFRSH_RUD_Msk & (_UINT32_(value) << ETH_PEFRSH_RUD_Pos)) /* Assignment of value for RUD in the ETH_PEFRSH register */
#define ETH_PEFRSH_Msk                        _UINT32_(0x0000FFFF)                                 /* (ETH_PEFRSH) Register Mask  */


/* -------- ETH_DPRAMFD : (ETH Offset: 0x10F8) (R/W 32) TX and RX packet buffer fill levels -------- */
#define ETH_DPRAMFD_RESETVALUE                _UINT32_(0x00)                                       /*  (ETH_DPRAMFD) TX and RX packet buffer fill levels  Reset Value */

#define ETH_DPRAMFD_TXRXSEL_Pos               _UINT32_(0)                                          /* (ETH_DPRAMFD) TX/RX Fill Level Select Position */
#define ETH_DPRAMFD_TXRXSEL_Msk               (_UINT32_(0x1) << ETH_DPRAMFD_TXRXSEL_Pos)           /* (ETH_DPRAMFD) TX/RX Fill Level Select Mask */
#define ETH_DPRAMFD_TXRXSEL(value)            (ETH_DPRAMFD_TXRXSEL_Msk & (_UINT32_(value) << ETH_DPRAMFD_TXRXSEL_Pos)) /* Assignment of value for TXRXSEL in the ETH_DPRAMFD register */
#define ETH_DPRAMFD_TXRXQSEL_Pos              _UINT32_(4)                                          /* (ETH_DPRAMFD) TX/RX Fill Level Queue Select Position */
#define ETH_DPRAMFD_TXRXQSEL_Msk              (_UINT32_(0xF) << ETH_DPRAMFD_TXRXQSEL_Pos)          /* (ETH_DPRAMFD) TX/RX Fill Level Queue Select Mask */
#define ETH_DPRAMFD_TXRXQSEL(value)           (ETH_DPRAMFD_TXRXQSEL_Msk & (_UINT32_(value) << ETH_DPRAMFD_TXRXQSEL_Pos)) /* Assignment of value for TXRXQSEL in the ETH_DPRAMFD register */
#define ETH_DPRAMFD_TXRXLVL_Pos               _UINT32_(16)                                         /* (ETH_DPRAMFD) TX/RX Buffer Fill Level Position */
#define ETH_DPRAMFD_TXRXLVL_Msk               (_UINT32_(0xFFFF) << ETH_DPRAMFD_TXRXLVL_Pos)        /* (ETH_DPRAMFD) TX/RX Buffer Fill Level Mask */
#define ETH_DPRAMFD_TXRXLVL(value)            (ETH_DPRAMFD_TXRXLVL_Msk & (_UINT32_(value) << ETH_DPRAMFD_TXRXLVL_Pos)) /* Assignment of value for TXRXLVL in the ETH_DPRAMFD register */
#define ETH_DPRAMFD_Msk                       _UINT32_(0xFFFF00F1)                                 /* (ETH_DPRAMFD) Register Mask  */


/* -------- ETH_REVREG : (ETH Offset: 0x10FC) ( R/ 32) TX and RX packet buffer fill levels -------- */
#define ETH_REVREG_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_REVREG) TX and RX packet buffer fill levels  Reset Value */

#define ETH_REVREG_MR_Pos                     _UINT32_(0)                                          /* (ETH_REVREG) Module Revision Position */
#define ETH_REVREG_MR_Msk                     (_UINT32_(0xFFFF) << ETH_REVREG_MR_Pos)              /* (ETH_REVREG) Module Revision Mask */
#define ETH_REVREG_MR(value)                  (ETH_REVREG_MR_Msk & (_UINT32_(value) << ETH_REVREG_MR_Pos)) /* Assignment of value for MR in the ETH_REVREG register */
#define ETH_REVREG_MID_Pos                    _UINT32_(16)                                         /* (ETH_REVREG) Module Identification Position */
#define ETH_REVREG_MID_Msk                    (_UINT32_(0xFFF) << ETH_REVREG_MID_Pos)              /* (ETH_REVREG) Module Identification Mask */
#define ETH_REVREG_MID(value)                 (ETH_REVREG_MID_Msk & (_UINT32_(value) << ETH_REVREG_MID_Pos)) /* Assignment of value for MID in the ETH_REVREG register */
#define ETH_REVREG_FN_Pos                     _UINT32_(28)                                         /* (ETH_REVREG) Fix Number Position */
#define ETH_REVREG_FN_Msk                     (_UINT32_(0xF) << ETH_REVREG_FN_Pos)                 /* (ETH_REVREG) Fix Number Mask */
#define ETH_REVREG_FN(value)                  (ETH_REVREG_FN_Msk & (_UINT32_(value) << ETH_REVREG_FN_Pos)) /* Assignment of value for FN in the ETH_REVREG register */
#define ETH_REVREG_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (ETH_REVREG) Register Mask  */


/* -------- ETH_OTLO : (ETH Offset: 0x1100) (R/W 32) Octets Transmitted [31:0] Register -------- */
#define ETH_OTLO_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_OTLO) Octets Transmitted [31:0] Register  Reset Value */

#define ETH_OTLO_TXO_Pos                      _UINT32_(0)                                          /* (ETH_OTLO) Transmitted Octets Position */
#define ETH_OTLO_TXO_Msk                      (_UINT32_(0xFFFFFFFF) << ETH_OTLO_TXO_Pos)           /* (ETH_OTLO) Transmitted Octets Mask */
#define ETH_OTLO_TXO(value)                   (ETH_OTLO_TXO_Msk & (_UINT32_(value) << ETH_OTLO_TXO_Pos)) /* Assignment of value for TXO in the ETH_OTLO register */
#define ETH_OTLO_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (ETH_OTLO) Register Mask  */


/* -------- ETH_OTHI : (ETH Offset: 0x1104) (R/W 32) Octets Transmitted [47:32] Register -------- */
#define ETH_OTHI_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_OTHI) Octets Transmitted [47:32] Register  Reset Value */

#define ETH_OTHI_TXO_Pos                      _UINT32_(0)                                          /* (ETH_OTHI) Transmitted Octets Position */
#define ETH_OTHI_TXO_Msk                      (_UINT32_(0xFFFF) << ETH_OTHI_TXO_Pos)               /* (ETH_OTHI) Transmitted Octets Mask */
#define ETH_OTHI_TXO(value)                   (ETH_OTHI_TXO_Msk & (_UINT32_(value) << ETH_OTHI_TXO_Pos)) /* Assignment of value for TXO in the ETH_OTHI register */
#define ETH_OTHI_Msk                          _UINT32_(0x0000FFFF)                                 /* (ETH_OTHI) Register Mask  */


/* -------- ETH_FT : (ETH Offset: 0x1108) (R/W 32) Frames Transmitted Register -------- */
#define ETH_FT_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_FT) Frames Transmitted Register  Reset Value */

